In [ ]:
0. 所有的题目结果中，给出SQL语句和执行结果。

1. 在新数据库中新建一张 user 表,插入几条数据,属性包含:唯一标识(id),姓名(name)性别(sex).年龄(age).联系方式(phone)，数据如下：

    ('John Doe', 'Male', 25, '123-456-7890')

    ('Jane Smith', 'Female', 31, '987-654-3210')
    
    ('Bob Johnson', 'Male', 22, '555-123-4567')

In [ ]:
CREATE TABLE users
(
    id int PRIMARY KEY auto_increment,
    name varchar(255),
    gender varchar(255),
    age int,
    phone char(12)
);
INSERT INTO users (name,gender,age,phone)VALUES('Bob Johnson', 'Male', 22, '555-123-4567');
INSERT INTO users (name,gender,age,phone)VALUES('John Doe', 'Male', 25, '123-456-7890');
INSERT INTO users (name,gender,age,phone)VALUES('Jane Smith', 'Female', 31, '987-654-3210');

In [ ]:
+----+-------------+--------+------+--------------+
| id | name        | gender | age  | phone        |
+----+-------------+--------+------+--------------+
|  1 | Bob Johnson | Male   |   22 | 555-123-4567 |
|  2 | John Doe    | Male   |   25 | 123-456-7890 |
|  3 | Jane Smith  | Female |   31 | 987-654-3210 |
+----+-------------+--------+------+--------------+

2. 写出 SQL语句,查询 user 表中所有年龄在 20-30 范围内的用户

In [ ]:
SELECT * FROM users WHERE age BETWEEN 20 AND 30;

In [ ]:
+----+-------------+--------+------+--------------+
| id | name        | gender | age  | phone        |
+----+-------------+--------+------+--------------+
|  1 | Bob Johnson | Male   |   22 | 555-123-4567 |
|  2 | John Doe    | Male   |   25 | 123-456-7890 |
+----+-------------+--------+------+--------------+

3. 写出SQL语句，向user表中添加自己的个人信息，并添加几条和你姓名同姓的虚拟信息。

In [ ]:
INSERT INTO users (name,gender,age,phone)VALUES('Enjolras Wang','Male',20,'137-024-6010');
INSERT INTO users (name,gender,age,phone)VALUES('Enjolras Wang','Female',26,'137-024-6011');
INSERT INTO users (name,gender,age,phone)VALUES('Enjolras Wang','Male',23,'137-012-6011');

4. 写出 SQL语句,查询 user 表中年龄在 20-30 范围内,名字包含“你的姓氏”的用户,并按照年龄从大到小排序输出

In [ ]:
SELECT*FROM users WHERE age BETWEEN 20 AND 30 AND name LIKE '%Wang%'
ORDER BY age DESC;

In [ ]:
+----+---------------+--------+------+--------------+
| id | name          | gender | age  | phone        |
+----+---------------+--------+------+--------------+
|  5 | Enjolras Wang | Female |   26 | 137-024-6011 |
|  6 | Enjolras Wang | Male   |   23 | 137-012-6011 |
|  4 | Enjolras Wang | Male   |   20 | 137-024-6010 |
+----+---------------+--------+------+--------------+

5. 写出 SQL 语句,计算 user 表中所有用户的平均年龄

In [ ]:
SELECT AVG(age) FROM users;

In [ ]:
+----------+
| AVG(age) |
+----------+
|  24.5000 |
+----------+

6. 新建两张表team 表(id,teamName)和score 表(id,teamid,userid,score)。其中score 表中的 teamid 为指向 team表id 的外键，userid 为指向 user表id的外键

In [ ]:
CREATE TABLE team (
    id INT PRIMARY KEY AUTO_INCREMENT,
    teamName VARCHAR(255),
);
CREATE TABLE score (
    id INT PRIMARY KEY AUTO_INCREMENT,
    teamid INT,
    userid INT,
    score INT,
    FOREIGN KEY (teamid) REFERENCES team(id),
    FOREIGN KEY (userid) REFERENCES users(id)
);
SHOW CREATE TABLE score;

In [ ]:
 score | CREATE TABLE `score` (
  `id` int NOT NULL AUTO_INCREMENT,
  `teamid` int DEFAULT NULL,
  `userid` int DEFAULT NULL,
  `score` int DEFAULT NULL,
  PRIMARY KEY (`id`),
  KEY `teamid` (`teamid`),
  KEY `userid` (`userid`),
  CONSTRAINT `score_ibfk_1` FOREIGN KEY (`teamid`) REFERENCES `team` (`id`),
  CONSTRAINT `score_ibfk_2` FOREIGN KEY (`userid`) REFERENCES `users` (`id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci |

7. 在team表中和score表中插入合适的记录，写出 SQL语句,查询 teamName 为“ECNU”的队伍中，年龄小于 20 的用户们，结果不得为空。

In [ ]:
INSERT INTO team (id,teamName) VALUES ('1', 'ECNU');

INSERT INTO users (name,gender,age) VALUES
('Alice','Female',19),
('Bob','Male',22),
('Cathy','Female',18);

INSERT INTO score (teamid,userid,score) VALUES
('1','7',85),
('1','9',90);

SELECT users. * FROM users
JOIN score ON users.id=score.userid
JOIN team ON score.teamid=team.id
WHERE team.teamName='ECNU' AND users.age<20;

In [ ]:
+----+-------+--------+------+
| id | name  | gender | age  | 
+----+-------+--------+------+
|  7 | Alice | Female |   19 |
|  9 | Cathy | Female |   18 |
+----+-------+--------+------+

8. 写出 SQL 语句,计算 teamName为“ECNU”的总分(假设 score 存在 null值,nul值默认为 0 加入计算)。

In [ ]:
SELECT SUM(COALESCE(score.score,0)) AS total_score FROM score
JOIN team ON score.teamid=team.id 
WHERE team.teamname='ECNU';

In [ ]:
+-------------+
| total_score |
+-------------+
|         175 |
+-------------+

9. 写出SQL语句，删除user表中个人信息的记录。

In [ ]:
mysql> DELETE FROM score;
Query OK, 0 rows affected (0.00 sec)

mysql> DROP TABLE score;
Query OK, 0 rows affected (0.02 sec)

mysql> DROP TABLE users;
Query OK, 0 rows affected (0.02 sec)